---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RoofBase
source: html/0effd9ab-3f4f-b8e5-a879-bf3ef04a939a.htm
---
# RoofBase Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.